config/InformationRegisters/АптекаОфисОперКасса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>АптекаОфисОперКасса</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВерсияФормата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПостановкиВОчередь</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПриёмаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторКодировки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодАптеки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодАптекиПолучателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИДЗаписиАптеки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИДЗапроса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодФирмы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проведен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусДокументаАптеки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипУпаковки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Удален</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФлагАрхива</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХМЛСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаСозданияПакета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

config/Enums/СтатусДокАптеки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СтатусДокАптеки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Неопределено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КОбработкеОфисом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проведен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аннулирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработанОфисом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетЗавершенияИнвентаризации</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/Enums/ВидыОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеТМЦ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеТМЦ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеТМЦСПереоценкой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаТМЦ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переоценка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеТМЦ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВАрбитраж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереоприходованиеЕИТ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МежскладскаяПередача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратНаСклад</Name>
					<Comment>Возврат товара из аптеки на склад</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияОпт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инвентаризация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеСтавкиНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриходныйОрдер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходныйОрдер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПомещениеВАрбитраж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратИзАрбитража</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетКомиссионера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеТМЦОтСобственныхЮрЛиц</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/Documents/КассовыйОрдер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>КассовыйОрдер</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОперационнаяКасса</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыданоПринято</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приложение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКассы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСмены</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВедомости</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВедомости</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДокАптеки</Name>
					<Comment>Статус документа в аптечном ПО</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусДокАптеки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомДокАптеки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДДокументаАптеки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнегоИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияДокументаАптеки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникАптеки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПослеИнкассации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDСессии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКвитанции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

config/CommonModules/ОперационнаяКасса/Ext/Module.bsl
Функция ПолучитьУпаковкиОперКассы()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АптекаОфис.Код КАК Код,
	               |	АптекаОфис.ТипУпаковки,
	               |	АптекаОфис.КодАптеки КАК КодАптеки,
	               |	АптекаОфис.ИдентификаторДокумента КАК ИДДокумента,
	               |	Аптеки.Ссылка КАК Склад,
	               |	Аптеки.Ссылка.Фирма КАК Фирма,
	               |	АптекаОфис.ДатаДокумента
	               |ИЗ
	               |	РегистрСведений.АптекаОфисОперКасса КАК АптекаОфис
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.МестаХранения КАК Аптеки
	               |		ПО (Аптеки.Код = АптекаОфис.КодАптеки)
	               |ГДЕ
	               |	АптекаОфис.ТипУпаковки = ""OPER_CASH""
	               |	И 111 = 111
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	КодАптеки,
	               |	Код";
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция РазобратьУпаковку(стр,Упаковка)
	
	Результат = Новый Структура;
	Результат.Вставить("Результат",Ложь);
	
	ХМЛ = Новый ЧтениеXML();
	Попытка
		ХМЛ.УстановитьСтроку(Упаковка);
	Исключение
		Возврат Результат;
	КонецПопытки;
	
		//<?xml version="1.0" encoding="WINDOWS-1251"?>
		//<document>
		//<pack_type>OPER_CASH</pack_type>
		//<fmt_ver>1</fmt_ver>
		
		//<hdr>
		//<id>794</id>
		//<id_doc_type>302</id_doc_type>
		//<guid>157abe62-a8ba-11e5-baa2-78e3b5fcba08</guid>
		//<ndoc>14</ndoc>
		//<ddoc>20151222174111</ddoc>
		//<status>3</status>
		//<id_acc>2</id_acc>
		//<operation>-1</operation>
		//<sum_order>33300.00</sum_order>
		//<id_session_hdr/>
		//<id_cash_collection_hdr>793</id_cash_collection_hdr>
		//<id_buyer_return_hdr/>
		//<id_prepay/>
		//<id_worker/>
		//<worker_tabnum/>
		//<id_bank>44585659</id_bank>
		//<num_sheet/>
		//<date_sheet/>
		//<appendix>Препроводительная ведомость №23895&#x2F;670 от 22.12.2015</appendix>
		//<dsc>Сданы денежные средства в банк</dsc>
		//<identification_doc/>
		//<rec_insert>20151222174128</rec_insert>
		//<rec_update>20160112112916</rec_update>
		//<login_key>admin</login_key>
		//<user_descr/>
		//<ver>3</ver>
		//<cash_amount_rest>1111.50</cash_amount_rest> - остаток наличности после инкассации.
		//</hdr>
		
		//<str/>
		
		//</document>
		//
		
		
		Шапка = Новый Структура();		
		
			
		Пока ХМЛ.Прочитать() Цикл
			Если ХМЛ.ТипУзла=ТипУзлаXML.НачалоЭлемента И ХМЛ.Имя="hdr" ТОгда
				Пока ХМЛ.Прочитать() Цикл
					Если ХМЛ.ТипУзла=ТипУзлаXML.НачалоЭлемента и ХМЛ.Имя="guid" Тогда
						ХМЛ.Прочитать();
						Если ХМЛ.ИмеетЗначение Тогда
							Шапка.Вставить("ИДДокументаАптеки",ХМЛ.Значение);
						КонецЕсли;
						
					ИначеЕсли ХМЛ.ТипУзла=ТипУзлаXML.НачалоЭлемента и ХМЛ.Имя="ndoc" Тогда
						ХМЛ.Прочитать();
						Если ХМЛ.ИмеетЗначение Тогда
							Шапка.Вставить("НомДокАптеки", ХМЛ.Значение );
						КонецЕсли;		
						
					ИначеЕсли ХМЛ.ТипУзла=ТипУзлаXML.НачалоЭлемента и ХМЛ.Имя="num_sheet" Тогда
						ХМЛ.Прочитать();
						Если ХМЛ.ИмеетЗначение Тогда
							Шапка.Вставить("НомерВедомости", СокрЛП(Формат(ХМЛ.Значение,"ЧГ=0")));
						КонецЕсли;		
						
					ИначеЕсли ХМЛ.ТипУзла=ТипУзлаXML.НачалоЭлемента и ХМЛ.Имя="date_sheet" Тогда
						ХМЛ.Прочитать();
						Если ХМЛ.ИмеетЗначение Тогда
							Шапка.Вставить("ДатаВедомости", Дата(ХМЛ.Значение));
						КонецЕсли;	
					ИначеЕсли ХМЛ.ТипУзла=ТипУзлаXML.НачалоЭлемента и ХМЛ.Имя="session" Тогда
						ХМЛ.Прочитать();
						Если ХМЛ.ИмеетЗначение Тогда
							Шапка.Вставить("IDСессии", СокрЛП(ХМЛ.Значение));
						КонецЕсли;	
					ИначеЕсли ХМЛ.ТипУзла=ТипУзлаXML.НачалоЭлемента и ХМЛ.Имя="receipt_no" Тогда
						ХМЛ.Прочитать();
						Если ХМЛ.ИмеетЗначение Тогда
							Шапка.Вставить("НомерКвитанции", СокрЛП(ХМЛ.Значение));
						КонецЕсли;						
						
					ИначеЕсли ХМЛ.ТипУзла=ТипУзлаXML.НачалоЭлемента и ХМЛ.Имя="ddoc" Тогда
						ХМЛ.Прочитать();
						Если ХМЛ.ИмеетЗначение Тогда
							Шапка.Вставить("ДатаДок", Дата(ХМЛ.Значение));
						КонецЕсли;		
						
					ИначеЕсли ХМЛ.ТипУзла=ТипУзлаXML.НачалоЭлемента и ХМЛ.Имя="id_acc" Тогда
						ХМЛ.Прочитать();
						Если ХМЛ.ИмеетЗначение Тогда
							Шапка.Вставить("Счет", Справочники.Счета.НайтиПоКоду(Число(ХМЛ.Значение))); 
							Шапка.Вставить("КодСчета", Число(ХМЛ.Значение));
						КонецЕсли;
						
						
					ИначеЕсли ХМЛ.ТипУзла=ТипУзлаXML.НачалоЭлемента и ХМЛ.Имя="id_bank" Тогда
						ХМЛ.Прочитать();
						Если ХМЛ.ИмеетЗначение Тогда
							Шапка.Вставить("КодБанка", СокрЛП(Формат(ХМЛ.Значение,"ЧГ=0"))); //Разбираем , но пока не используем
						КонецЕсли;	
						
						
					ИначеЕсли ХМЛ.ТипУзла=ТипУзлаXML.НачалоЭлемента и ХМЛ.Имя="sum_order" Тогда
						ХМЛ.Прочитать();
						Если ХМЛ.ИмеетЗначение Тогда
							Если ПустаяСтрока(ХМЛ.Значение)=Ложь ТОгда
								Шапка.Вставить("Сумма", Число(ХМЛ.Значение));
							КонецЕсли;
						КонецЕсли;
						
					ИначеЕсли ХМЛ.ТипУзла=ТипУзлаXML.НачалоЭлемента и ХМЛ.Имя="cash_amount_rest" Тогда
						ХМЛ.Прочитать();
						Если ХМЛ.ИмеетЗначение Тогда
							Если ПустаяСтрока(ХМЛ.Значение)=Ложь ТОгда
								Шапка.Вставить("СуммаПослеИнкассации", Число(ХМЛ.Значение));
							КонецЕсли;
						КонецЕсли;						
						
					ИначеЕсли ХМЛ.ТипУзла=ТипУзлаXML.НачалоЭлемента и ХМЛ.Имя="appendix" Тогда
						ХМЛ.Прочитать();
						Если ХМЛ.ИмеетЗначение Тогда
							Если ПустаяСтрока(ХМЛ.Значение)=Ложь ТОгда
								Шапка.Вставить("Приложение", СокрЛП(ХМЛ.Значение));
							КонецЕсли;
						КонецЕсли;
						
					ИначеЕсли ХМЛ.ТипУзла=ТипУзлаXML.НачалоЭлемента и ХМЛ.Имя="dsc" Тогда
						ХМЛ.Прочитать();
						Если ХМЛ.ИмеетЗначение Тогда
							Если ПустаяСтрока(ХМЛ.Значение)=Ложь ТОгда
								Шапка.Вставить("Описание", СокрЛП(ХМЛ.Значение));
							КонецЕсли;
						КонецЕсли;
						
						
					ИначеЕсли ХМЛ.ТипУзла=ТипУзлаXML.НачалоЭлемента и ХМЛ.Имя="identification_doc" Тогда
						ХМЛ.Прочитать();
						Если ХМЛ.ИмеетЗначение Тогда
							Если ПустаяСтрока(ХМЛ.Значение)=Ложь ТОгда
								Шапка.Вставить("Паспорт", СокрЛП(ХМЛ.Значение));   //Разбираем , но пока не используем
							КонецЕсли;
						КонецЕсли;
						
						
					ИначеЕсли ХМЛ.ТипУзла=ТипУзлаXML.НачалоЭлемента и ХМЛ.Имя="status" Тогда
						ХМЛ.Прочитать();
						Если ХМЛ.ИмеетЗначение Тогда
							Если ПустаяСтрока(ХМЛ.Значение)=Ложь ТОгда
								Шапка.Вставить("СтатусДокАптеки",Число(ХМЛ.Значение));
							КонецЕсли;
						КонецЕсли;
						
					ИначеЕсли ХМЛ.ТипУзла=ТипУзлаXML.НачалоЭлемента и ХМЛ.Имя="operation" Тогда
						ХМЛ.Прочитать();
						Если ХМЛ.ИмеетЗначение Тогда
							Если ПустаяСтрока(ХМЛ.Значение)=Ложь ТОгда
								Шапка.Вставить("КодВидаОперации",Число(ХМЛ.Значение));
							КонецЕсли;
						КонецЕсли;
					ИначеЕсли ХМЛ.ТипУзла=ТипУзлаXML.НачалоЭлемента и ХМЛ.Имя="user_descr" Тогда
						ХМЛ.Прочитать();
						Если ХМЛ.ИмеетЗначение Тогда
							Если ПустаяСтрока(ХМЛ.Значение)=Ложь ТОгда
								Шапка.Вставить("СотрудникАптеки", СокрЛП(ХМЛ.Значение));
							КонецЕсли;
						КонецЕсли;
						
						
						
					ИначеЕсли ХМЛ.ТипУзла=ТипУзлаXML.КонецЭлемента и ХМЛ.Имя="hdr" Тогда  // это конец шапки	
						
						Прервать; // Закончили обрабатывать шапку , нужно выйти в верхний цикл.
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
		ХМЛ.Закрыть();
		
		Результат.Вставить("Шапка",Шапка);
		Результат.Результат = Истина;
		
		Возврат Результат;
		
	
	
	КонецФункции
	
Процедура СоздатьКассовыйОрдер(стр,СтруктураРезультата)
	
	Шапка = СтруктураРезультата.Шапка;
	
	Если Шапка.КодСчета = 7 или  Шапка.КодСчета = 11 или Шапка.КодСчета = 13 или Шапка.ДатаДок < Дата(2017,08,18) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;                                                    
	Запрос.Текст = "ВЫБРАТЬ
	               |	Ордер.Ссылка
	               |ИЗ
	               |	Документ.КассовыйОрдер КАК Ордер
	               |ГДЕ
	               |	Ордер.ИДДокументаАптеки = &ИДДокументаАптеки
	               |	И Ордер.Склад = &Склад";
	
	Запрос.УстановитьПараметр("ИДДокументаАптеки",Шапка.ИДДокументаАптеки);
	Запрос.УстановитьПараметр("Склад",стр.Склад);
	
	Рез = Запрос.Выполнить();
	ЭтоНовыйДокумент = Ложь;
	ДокОбъект = Неопределено;
	Если Рез.Пустой() Тогда
		Док = Документы.КассовыйОрдер.СоздатьДокумент();
		
		ЭтоНовыйДокумент = Истина;
	Иначе
		Выборка = Рез.Выбрать();
		Выборка.Следующий();
		Док = Выборка.Ссылка.ПолучитьОбъект();
	КонецЕсли;
	пер_Статус = Перечисления.СтатусДокАптеки.Получить(Шапка.СтатусДокАптеки);
	
	ЗаполнитьЗначенияСвойств(Док,Шапка);
	
	Док.Дата = Шапка.ДатаДок;
	Док.СтатусДокАптеки = пер_Статус;
	Если Шапка.КодВидаОперации = - 1 Тогда
		Док.ВидОперации = Перечисления.ВидыОпераций.РасходныйОрдер;
	ИначеЕсли Шапка.КодВидыОперации = 1 Тогда
		Док.ВидОперации = Перечисления.ВидыОпераций.ПриходныйОрдер;
	КонецЕсли;
	Док.Склад = стр.Склад;
	Док.Фирма = стр.Фирма;
	
	Если Док.СтатусДокАптеки = Перечисления.СтатусДокАптеки.Проведен Тогда
		Док.Записать(РежимЗаписиДокумента.Проведение);
	ИначеЕсли Док.СтатусДокАптеки = Перечисления.СтатусДокАптеки.Создан Тогда
		Если Док.Проведен = Истина Тогда
			Док.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		Иначе
			Док.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
	ИначеЕсли Док.СтатусДокАптеки = Перечисления.СтатусДокАптеки.Аннулирован Тогда
		Если Док.Проведен = Истина Тогда
			Док.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		Иначе
			Док.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
	КонецЕсли;
	
	
	
	
КонецПроцедуры

Процедура УдалитьУпаковку(КодУпаковки)
	
			НЗ=РегистрыСведений.АптекаОфисОперКасса.СоздатьНаборЗаписей();
			НЗ.Отбор.Код.Установить(КодУпаковки,Истина);
			НЗ.Записать();	
	
КонецПроцедуры

Процедура ЗагрузитьОперационнуюКассу() Экспорт
	
	Упаковки = ПолучитьУпаковкиОперКассы();	
	
	н=0;
	Всего = Упаковки.Количество();
	Для каждого стр из Упаковки Цикл
		н=н+1;
		#Если Клиент Тогда
			ОбработкаПрерыванияПользователя();
			Если н%100 = 0 Тогда
				Состояние("обработка: " + н + " из " + Всего);
			КонецЕсли;
		#КонецЕсли
	
		МЗ = РегистрыСведений.АптекаОфисОперКасса.СоздатьМенеджерЗаписи();
		МЗ.Код = стр.Код;
		МЗ.Прочитать();
		
		Если НЕ МЗ.Выбран() Тогда
			Продолжить;
		КонецЕсли;
		
		Упаковка = МЗ.ХМЛСтрока; 
		СтруктураРезультата = РазобратьУпаковку(стр, Упаковка);	
		Если СтруктураРезультата.Результат = Истина Тогда
			СоздатьКассовыйОрдер(стр,СтруктураРезультата);	
			УдалитьУпаковку(стр.Код);
		КонецЕсли;
		
		
			
	КонецЦикла;
	
	
КонецПроцедуры
